# 3.	По введенным пользователем координатам двух точек вывести
# уравнение прямой вида y = kx + b, проходящей через эти точки.

'''

20191115 Sikorskiy Yuriy
cs.yury.v@pm.me

'''

try:
    print('Введите координаты точки A(x1, y1)')
    x1 = float(input('x1 <- '))
    y1 = float(input('y1 <- '))
    print('Введите координаты точки B(x2, y2)')
    x2 = float(input('x2 <- '))
    y2 = float(input('y2 <- '))
except ValueError:
    print('Неккоректный ввод. Программа завершена.')
    exit(-1)

if x1 == x2:
    print('Абсциссы точек не должны совпадать. Программа завершена.')
    exit(-2)

print("Уравнение прямой, проходящей через эти точки:")
k = (y1 - y2) / (x1 - x2)
b = y2 - k * x2
print(f' y = {k:.2f}*x + {b:.2f}')
