"""
7.	По длинам трех отрезков, введенных пользователем, определить возможность
существования треугольника, составленного из этих отрезков. Если такой
треугольник существует, то определить, является ли он
разносторонним, равнобедренным или равносторонним.

20191116 Sikorskiy Yuriy
cs.yury.v@pm.me

"""
print('Введите длины трех отрезков.')
try:
    a =  float(input('Длина первого отрезка <- '))
    b =  float(input('Длина второго отрезка <- '))
    c =  float(input('Длина третьего отрезка <- '))
except ValueError:
    print('Некорректный ввод. Программа завершена.')
    exit(-1)

# Проверяю мргут ли эти отрезки быть сторонами треугольника
if (a+b) <= c or (a+c) <= b or (b + c) <= a:
    print('Отрезки не могут быть сторонами треугольника.')
    exit(0)

# Проверяю является ли треугольник равнсторонним
if a == b and a==c:
    print('Отрезки могут быть сторонами равностороннего треугольника.')
elif (a==b and a != c) or(a == c and a != b) or (b == c and b != a):
    print('Отрезки могут быть сторонами равнобедренного треугольника.')
else:
    print('Отрезки могут быть сторонами треугольника.')


