# 9.Вводятся три разных числа. Найти, какое из них
# является средним (больше одного, но меньше другого).

print('Введите три разных числа.')
try:
    a1 = float(input('Введите первое число <- '))
    a2 = float(input('Введите второе число <- '))
    a3 = float(input('Введите третье число <- '))
except ValueError:
    print('Некорректный ввод. Программа завершена.')
    exit(-1)

if a1 == a2 or a1 == a3 or a2 == a3:
    print('Некорректный ввод. Программа завершена.')
    exit(0)

if (a1 > a2 and a1 < a3) or (a1 < a2 and a1 > a3):
    print(f'Значени первого числа - {a1} находится меду двумя другими')
elif (a2 > a1 and a2 < a3) or (a2 < a1 and a2 > a3):
    print(f'Значени второго числа - {a2} находится меду двумя другими')
elif (a3 > a1 and a3 < a2) or (a3 < a1 and a3 > a2):
    print(f'Значени третьего числа - {a3} находится меду двумя другими')
