"""
2.	Посчитать четные и нечетные цифры введенного натурального числа.
Например, если введено число 34560, то у него 3 четные цифры
(4, 6 и 0) и 2 нечетные (3 и 5).

0191116 Sikorskiy Yuriy
cs.yury.v@pm.me

Нет единого мнения по поводу того входит или не входит 0 во множество натуральных чисел.
Поэтому для данной задачи я принимаю множество натуральных чисел без нуля.
"""

try:
    a = int(input('Введите натуральное число <- '))
except ValueError:
    print('Некорректный ввод. Программа завершена.')
    exit(-1)
if a <= 0:
    print('Некорректный ввод. Программа завершена.')
    exit(0)

i = a
number_of_even_digits = 0
number_of_odd_digits = 0
while i > 0:
    digit = i % 10
    if digit % 2 == 0:
        number_of_even_digits += 1
    else:
        number_of_odd_digits += 1
    i = i // 10

print(f'В {a} - {number_of_even_digits} четных(ая) и {number_of_odd_digits} нечетных(ая) цифры(а).')
