'''

20191122 Sikorskiy Yuriy
cs.yury.v@pm.me

2.	Во втором массиве сохранить индексы четных элементов первого массива.
Например, если дан массив со значениями 8, 3, 15, 6, 4, 2, то во второй массив
надо заполнить значениями 1, 4, 5, 6
(или 0, 3, 4, 5 - если индексация начинается с нуля),
т.к. именно в этих позициях первого массива стоят четные числа.
'''

a = [8, 3, 15, 6, 4, 2]

indices_of_even_elements = []
for i in range(len(a)):
    if a[i] % 2 == 0:
        indices_of_even_elements.append(i)

print(indices_of_even_elements)
